_label2id = {
    "отка": 0,
    "мен": 1,
    "подтверждени": 2,
    "нача сажив": 3,
    "осади вагон": 4,
    "дить вагон": 4,
    "продолжа осаживани": 5,
    "заряд тормоз магистрал": 6,
    "выш вагон простран": 7,
    "продолжа пуск": 8,
    "растяну цеп": 9,
    "протяну вагон": 10,
    "цеп": 11,
    "назад на баш": 12,
    "хожу вагон простран": 13,
    "танов": 14,
    "пере на баш": 15,
    "сжать автосцепки": 16,
    "назад с баш": 17,
    "тиш": 18,
    "вперед с баш": 19,
    "прекрати заряд тормоз магистрал": 20,
    "тормоз": 21,
    "пусти": 22,
}

_id2label = {
    0: "отказ",
    1: "отмена",
    2: "подтверждение",
    3: "начать осаживание",
    4: "осадить на вагон",
    5: "продолжаем осаживание",
    6: "зарядка тормозной магистрали",
    7: "вышел из межвагонного пространства",
    8: "продолжаем роспуск",
    9: "растянуть автосцепки",
    10: "протянуть на вагон",
    11: "отцепка",
    12: "назад на башмак",
    13: "захожу в межвагонное пространство",
    14: "остановка",
    15: "вперед на башмак",
    16: "сжать автосцепки",
    17: "назад с башмака",
    18: "тише",
    19: "вперед с башмака",
    20: "прекратить зарядку тормозной магистрали",
    21: "тормозить",
    22: "отпустить",
}


class Numbers:
    units = {
        "ноль": 0,
        "один": 1,
        "два": 2,
        "три": 3,
        "четыре": 4,
        "пять": 5,
        "шесть": 6,
        "семь": 7,
        "восемь": 8,
        "девять": 9,
        "десять": 10,
        "одиннадцать": 11,
        "двенадцать": 12,
        "тринадцать": 13,
        "четырнадцать": 14,
        "пятнадцать": 15,
        "шестнадцать": 16,
        "семнадцать": 17,
        "восемнадцать": 18,
        "девятнадцать": 19,
    }
    tens = {
        "двадцать": 20,
        "тридцать": 30,
        "сорок": 40,
        "пятьдесят": 50,
        "шестьдесят": 60,
        "семьдесят": 70,
        "восемьдесят": 80,
        "девяносто": 90,
    }
    hundreds = {
        "сто": 100,
        "двести": 200,
        "триста": 300,
        "четыреста": 400,
        "пятьсот": 500,
        "шестьсот": 600,
        "семьсот": 700,
        "восемьсот": 800,
        "девятьсот": 900,
    }


def label2id(label: str) -> int:
    global _label2id
    return _label2id[label]


def id2label(id: int) -> str:
    global _id2label
    return _id2label[id]
